# CLI tools
brew "git"
brew "git-lfs"
brew "fnm"
brew "exiftool"
brew "ffmpeg"
brew "gh"
brew "imagemagick"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mas"

# ── Casks ─────────────────────────────────────────────────────────────────────

# Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Dev
cask "docker"
cask "sequel-ace"
cask "visual-studio-code"

# Design / creative
cask "acorn"            # direct download (also on MAS)
cask "blender"
cask "figma"
cask "kaleidoscope"
cask "pdfpen"
cask "rightfont"

# Productivity
cask "1password"
cask "granola"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "soulver"          # direct download (also on MAS)
cask "todoist"
cask "transmit"

# Communication
cask "discord"
cask "slack"
cask "zoom"

# Media
cask "plex"
cask "plexamp"
cask "vlc"

# Utilities
cask "adobe-dng-converter"
cask "claude"
cask "nordvpn"
cask "qgis"
cask "sonos"
cask "tailscale"
cask "vienna"

# ── Mac App Store ─────────────────────────────────────────────────────────────
# Requires: signing into the App Store before running `brew bundle`

# Third-party MAS apps
mas "Bear",                id: 1091189122
mas "Shapr3D",             id: 1091675654
mas "Trello",              id: 1278508951

# ── Manual installs ───────────────────────────────────────────────────────────
# These can't be automated — install by hand after running brew bundle:
#
#   Adobe apps        — install inside Creative Cloud after cask installs it
#   Screens 5         — MAS (cask deprecated); id may be 1663047912
#   Readwise Reader   — no cask; download from readwise.io
#   Kaleidoscope      — cask above; needs license
#   Cavalry, Eduard, Fastmail, Table Tool
#   — verify on MAS or vendor site
