# CLI tools
brew "git"
brew "git-lfs"
brew "fnm"
brew "exiftool"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mas"

# ── Casks ─────────────────────────────────────────────────────────────────────

# Browsers
cask "arc"
cask "brave-browser"
cask "chromium"
cask "firefox"
cask "google-chrome"

# Dev
cask "cursor"
cask "docker"
cask "sequel-ace"
cask "visual-studio-code"
cask "warp"

# Design / creative
cask "acorn"            # direct download (also on MAS)
cask "blender"
cask "davinci-resolve"
cask "eagle"
cask "figma"
cask "kaleidoscope"
cask "pdfpen"
cask "rightfont"
cask "xscope"

# Productivity
cask "1password"
cask "capacities"
cask "granola"
cask "linear-linear"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask "soulver"          # direct download (also on MAS)
cask "todoist"
cask "transmit"

# Communication
cask "discord"
cask "signal"
cask "slack"
cask "whatsapp"
cask "zoom"

# Media
cask "plex"
cask "plexamp"
cask "vlc"

# Utilities
cask "adobe-dng-converter"
cask "claude"
cask "diffusionbee"
cask "gramps"
cask "hazeover"
cask "nordvpn"
cask "qgis"
cask "sonos"
cask "tailscale"
cask "vienna"

# ── Mac App Store ─────────────────────────────────────────────────────────────
# Requires: signing into the App Store before running `brew bundle`

# Apple free apps
mas "GarageBand",          id: 682658836
mas "iMovie",              id: 408981434
mas "Keynote",             id: 409183694
mas "Numbers",             id: 409203825
mas "Pages",               id: 409201541
mas "TestFlight",          id: 899247664
# mas "Xcode",             id: 497799835   # ~15 GB — install manually

# Third-party MAS apps
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2",    id: 1616822987
mas "Affinity Publisher 2",id: 1606941598
mas "Bear",                id: 1091189122
mas "Clocker",             id: 1056643111
mas "Deliveries",          id: 290986013
mas "Ice Cubes",           id: 1642288028
mas "Parcel",              id: 639968404
mas "Shapr3D",             id: 1091675654
mas "Trello",              id: 1278508951

# ── Manual installs ───────────────────────────────────────────────────────────
# These can't be automated — install by hand after running brew bundle:
#
#   Adobe apps        — install inside Creative Cloud after cask installs it
#   Screens 5         — MAS (cask deprecated); id may be 1663047912
#   Readwise Reader   — no cask; download from readwise.io
#   Glyphfinder       — check glyphfinder.com or MAS
#   Kaleidoscope      — cask above; needs license
#   Save to Reader    — browser extension
#   Aeronaut, Antigravity, Bloom, Cavalry, Copilot, Datasette,
#   Eduard, Fastmail, FMail3, Helium, Hytale Launcher, JSON Peep,
#   MiniWhisper, Nitro, Pencil, SwitchGlass, Table Tool
#   — verify on MAS or vendor site
